In [51]:
import pandas as pd
import numpy as np

In [36]:
df=pd.read_csv(r"E:\Images\car_dataset.csv")
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [37]:
df['owner'].value_counts()

owner
First Owner     20
Second Owner    18
Third Owner     12
Name: count, dtype: int64

one hot encoding using pandas

In [38]:
pd.get_dummies(df,columns=['fuel','owner']).head()

,brand,km_driven,selling_price,fuel_Diesel,fuel_Petrol,owner_First Owner,owner_Second Owner,owner_Third Owner
0,Maruti,145500,450000,True,False,True,False,False
1,Skoda,120000,370000,True,False,False,True,False
2,Honda,140000,158000,False,True,False,False,True
3,Hyundai,127000,225000,True,False,True,False,False
4,Maruti,120000,130000,False,True,True,False,False

k-1 one hot encoding

In [39]:
pd.get_dummies(df,columns=['fuel','owner'],drop_first=True).head()

,brand,km_driven,selling_price,fuel_Petrol,owner_Second Owner,owner_Third Owner
0,Maruti,145500,450000,False,False,False
1,Skoda,120000,370000,False,True,False
2,Honda,140000,158000,True,False,True
3,Hyundai,127000,225000,False,False,False
4,Maruti,120000,130000,True,False,False

In [40]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=0)

In [41]:
from sklearn.preprocessing import OneHotEncoder

In [42]:
ohe=OneHotEncoder(drop='first')

In [43]:
X_train_new=ohe.fit_transform(X_train[['fuel','owner']]).toarray()

In [44]:
X_test_new=ohe.transform(X_test[['fuel','owner']]).toarray()

In [45]:
X_train_new.shape

(40, 3)

In [46]:
np.hstack((X_train[['brand','km_driven']].values,X_train_new))

array([['Honda', 118000, 1.0, 0.0, 0.0],
       ['Tata', 99000, 1.0, 0.0, 0.0],
       ['Fiat', 110000, 1.0, 1.0, 0.0],
       ['Toyota', 149000, 0.0, 1.0, 0.0],
       ['Honda', 99000, 0.0, 0.0, 0.0],
       ['Toyota', 132000, 1.0, 0.0, 0.0],
       ['Toyota', 141000, 0.0, 0.0, 0.0],
       ['MG', 95000, 0.0, 0.0, 0.0],
       ['Honda', 119000, 1.0, 0.0, 0.0],
       ['MG', 145000, 0.0, 0.0, 1.0],
       ['Hyundai', 151000, 1.0, 1.0, 0.0],
       ['Maruti', 155000, 0.0, 0.0, 0.0],
       ['Skoda', 137500, 0.0, 0.0, 1.0],
       ['Skoda', 143000, 0.0, 0.0, 0.0],
       ['Mahindra', 148000, 0.0, 0.0, 0.0],
       ['Renault', 125000, 1.0, 1.0, 0.0],
       ['Volkswagen', 151000, 0.0, 0.0, 1.0],
       ['Hyundai', 115000, 0.0, 0.0, 1.0],
       ['Tata', 119500, 1.0, 1.0, 0.0],
       ['Mahindra', 142000, 1.0, 0.0, 1.0],
       ['Tata', 98000, 0.0, 0.0, 0.0],
       ['Maruti', 128000, 1.0, 1.0, 0.0],
       ['Jeep', 122000, 0.0, 0.0, 1.0],
       ['Hyundai', 142500, 0.0, 1.0, 0.0],
       ['Skoda', 120000, 0.0, 1.0, 0.0],
       ['Ford', 123000, 0.0, 0.0, 1.0],
       ['Kia', 112000, 1.0, 0.0, 1.0],
       ['Chevrolet', 160000, 0.0, 0.0, 0.0],
       ['Ford', 156000, 1.0, 1.0, 0.0],
       ['Volkswagen', 150000, 1.0, 1.0, 0.0],
       ['Ford', 124000, 0.0, 1.0, 0.0],
       ['Kia', 117000, 0.0, 0.0, 0.0],
       ['Tata', 130000, 1.0, 0.0, 1.0],
       ['Skoda', 134500, 1.0, 0.0, 0.0],
       ['Fiat', 130000, 1.0, 1.0, 0.0],
       ['Datsun', 129000, 1.0, 0.0, 1.0],
       ['Hyundai', 127000, 0.0, 0.0, 0.0],
       ['Maruti', 145500, 0.0, 0.0, 0.0],
       ['Maruti', 104000, 0.0, 1.0, 0.0],
       ['Chevrolet', 139000, 1.0, 1.0, 0.0]], dtype=object)

In [47]:
counts=df['brand'].value_counts()

In [48]:
df['brand'].nunique()
threshold=3

In [49]:
repl=counts[counts<=threshold].index

In [50]:
pd.get_dummies(df['brand'].replace(repl,'uncommon')).sample(5)

    Honda  Hyundai  Maruti  Skoda   Tata  uncommon
39  False    False   False  False  False      True
16  False    False   False   True  False     False
18   True    False   False  False  False     False
4   False    False    True  False  False     False
21  False    False   False  False  False      True